# NewElementId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewElementId Method
Application Class See Also
---
Creates a new Autodesk::Revit::DB::ElementId^ object.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId NewElementId()
```

Visual Basic
---
```text
Public Function NewElementId As ElementId
```

Visual C++
---
```text
public:
ElementId^ NewElementId()
```

# ### Return Value
The new Autodesk::Revit::DB::ElementId^ object.
# See Also
Application Class
Autodesk.Revit.Creation Namespace